Revit 2027 API
ModuleSettings.Name Property
 The module name.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
member Name : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace